{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "batch_input_shape": [null, 21, 21, 1], "activation": "linear", "use_bias": true, "units": 441, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_1", "data_format": "channels_last", "filters": 16, "activation": "elu", "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_2", "data_format": "channels_last", "filters": 16, "activation": "elu", "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_3", "data_format": "channels_last", "filters": 16, "activation": "elu", "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_4", "data_format": "channels_last", "filters": 16, "activation": "elu", "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_5", "data_format": "channels_last", "filters": 16, "activation": "elu", "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_6", "data_format": "channels_last", "filters": 16, "activation": "elu", "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 128, "name": "dense_2", "activation": "elu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 2, "name": "dense_3", "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.5"}